cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32G232F32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PCNT1</name>
      <version>5.7.0</version>
      <description>PCNT1</description>
      <baseAddress>0x40086400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PCNT1</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The module is disabled.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVSSINGLE</name>
                  <description>Single input LFACLK oversampling mode (available in EM0-EM2).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLKSINGLE</name>
                  <description>Externally clocked single input counter mode (available in EM0-EM3).</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLKQUAD</name>
                  <description>Externally clocked quadrature decoder mode (available in EM0-EM3).</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTDIR</name>
              <description>Non-Quadrature Mode Counter Direction Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE</name>
              <description>Edge Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILT</name>
              <description>Enable Digital Pulse Width Filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTEN</name>
              <description>Enable PCNT Clock Domain Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LCNTIM</name>
              <description>Load CNT Immediately</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LTOPBIM</name>
              <description>Load TOPB Immediately</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DIR</name>
              <description>Current Counter Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>Counter Value Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOP</name>
          <description>Top Value Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TOP</name>
              <description>Counter Top Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOPB</name>
          <description>Top Value Buffer Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TOPB</name>
              <description>Counter Top Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>Underflow Interrupt Read Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OF</name>
              <description>Overflow Interrupt Read Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>Direction Change Detect Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>Underflow interrupt set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OF</name>
              <description>Overflow Interrupt Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>Direction Change Detect Interrupt Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>Underflow Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OF</name>
              <description>Overflow Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>Direction Change Detect Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>UF</name>
              <description>Underflow Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCNG</name>
              <description>Direction Change Detect Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTE</name>
          <description>I/O Routing Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000300</resetMask>
          <fields>
            <field>
              <name>LOCATION</name>
              <description>I/O Location</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREEZE</name>
          <description>Freeze Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>REGFREEZE</name>
              <description>Register Update Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CTRL</name>
              <description>CTRL Register Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD Register Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOPB</name>
              <description>TOPB Register Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
